app/Services/CafeLanguageService.php

    public function syncForCafe(int $cafeId, array $selectedLanguages): bool
    {
        $codes = $this->normalizeLanguageCodes($selectedLanguages);

        if (! $this->validateSelection($codes)) {
            return false;
        }

        $db = Database::connect();

        $this->cafeLanguages->where('cafe_id', $cafeId)->delete();

        $rows = [];

        foreach ($codes as $index => $code) {
            $rows[] = [
                'cafe_id'       => $cafeId,
                'language_code' => $code,
                'sort_order'    => $index + 1,
            ];
        }

        if ($rows !== [] && $this->cafeLanguages->insertBatch($rows) === false) {
---
DELETE FROM `cafe_languages`
WHERE `cafe_id` = 3
INSERT INTO `cafe_languages` (`cafe_id`, `language_code`, `sort_order`)
VALUES (3,'en',1), (3,'ru',2)