app/Services/CafeService.php

SELECT *
FROM `cafes`
WHERE `cafes`.`id` = 3
---
    public function getCurrentCafe(): ?array
    {
        $cafeId = session('cafe_id');

        if (! is_numeric($cafeId)) {
            return null;
        }

        return $this->cafes->find((int) $cafeId);

SELECT *
FROM `cafes`
WHERE `cafes`.`id` = 3
UPDATE `cafes` SET `menu_updated_at` = '2026-04-29 23:27:38'
WHERE `cafes`.`id` IN (3)
---
    public function touchMenuUpdatedAt(int $cafeId): void
    {
        $cafe = $this->cafes->find($cafeId);

        if ($cafe === null) {
            return;
        }

        $this->cafes->skipValidation(true)->update($cafeId, [
            'menu_updated_at' => (new DateTimeImmutable('now'))->format('Y-m-d H:i:s'),
        ]);