app/Controllers/CafeSettingsController.php

        $db = Database::connect();
        $db->transBegin();

        if ($this->cafes->update((int) $cafe['id'], $data) === false) {
---
UPDATE `cafes` SET `phone` = '+998946875461', `person_name` = 'Ahmed', `cafe_name` = 'Super cafe', `slogan` = '', `currency_name` = 'UZS', `theme_style` = 'theme1', `address_text` = '', `location_url` = '', `status` = 'active'
WHERE `cafes`.`id` IN (3)