app/Models/AdminModel.php

SELECT *
FROM `admin`
WHERE `admin`.`id` = 1
---
    public function getSingleton(): ?array
    {
        return $this->find(1);