app/Models/CafeLanguageModel.php

    public function getByCafe(int $cafeId): array
    {
        return $this->where('cafe_id', $cafeId)
            ->orderBy('sort_order', 'ASC')
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `cafe_languages`
WHERE `cafe_id` = 3
ORDER BY `sort_order` ASC, `id` ASC