app/Models/CafeModel.php

    public function findActiveByUsername(string $username): ?array
    {
        return $this->where('username', $username)
            ->where('status', 'active')
            ->first();
---
SELECT *
FROM `cafes`
WHERE `username` = 'demo'
AND `status` = 'active'
 LIMIT 1

    public function findRecentActive(int $limit = 10): array
    {
        return $this->select(['username', 'cafe_name', 'created_at'])
            ->where('status', 'active')
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT `username`, `cafe_name`, `created_at`
FROM `cafes`
WHERE `status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 10