app/Models/CafeFeeTranslationModel.php

    public function getByCafeId(int $cafeId, array $languageCodes = []): array
    {
        $builder = $this->where('cafe_id', $cafeId);

        if ($languageCodes !== []) {
            $builder->whereIn('language_code', $languageCodes);
        }

        $translations = $builder
            ->orderBy('language_code', 'ASC')
            ->findAll();
---
SELECT *
FROM `cafe_fee_translations`
WHERE `cafe_id` = 3
ORDER BY `language_code` ASC