app/Models/CategoryModel.php

    public function getByCafe(int $cafeId, bool $activeOnly = false): array
    {
        $builder = $this->select('categories.*, category_translations.name AS name, category_translations.language_code AS default_language_code')
            ->join('cafe_languages', 'cafe_languages.cafe_id = categories.cafe_id AND cafe_languages.sort_order = 1', 'left')
            ->join('category_translations', 'category_translations.category_id = categories.id AND category_translations.language_code = cafe_languages.language_code', 'left')
            ->where('categories.cafe_id', $cafeId)
            ->orderBy('categories.sort_order', 'ASC')
            ->orderBy('categories.id', 'ASC');

        if ($activeOnly) {
            $builder->where('categories.is_active', 1);
        }

        return $builder->findAll();
---
SELECT `categories`.*, `category_translations`.`name` AS `name`, `category_translations`.`language_code` AS `default_language_code`
FROM `categories`
LEFT JOIN `cafe_languages` ON `cafe_languages`.`cafe_id` = `categories`.`cafe_id` AND `cafe_languages`.`sort_order` = 1
LEFT JOIN `category_translations` ON `category_translations`.`category_id` = `categories`.`id` AND `category_translations`.`language_code` = `cafe_languages`.`language_code`
WHERE `categories`.`cafe_id` = 2
ORDER BY `categories`.`sort_order` ASC, `categories`.`id` ASC