app/Models/CategoryTranslationModel.php

    public function getByCategoryIds(array $categoryIds, array $languageCodes = []): array
    {
        if ($categoryIds === []) {
            return [];
        }

        $builder = $this->whereIn('category_id', $categoryIds);

        if ($languageCodes !== []) {
            $builder->whereIn('language_code', $languageCodes);
        }

        return $builder
            ->orderBy('category_id', 'ASC')
            ->orderBy('language_code', 'ASC')
            ->findAll();
---
SELECT *
FROM `category_translations`
WHERE `category_id` IN (1,2)
AND `language_code` IN ('en','uz')
ORDER BY `category_id` ASC, `language_code` ASC