app/Models/MenuItemModel.php

SELECT `menu_items`.*, `item_translation`.`name` AS `name`, `item_translation`.`description` AS `description`, `category_translation`.`name` AS `category_name`, `categories`.`is_active` AS `category_is_active`
FROM `menu_items`
LEFT JOIN `cafe_languages` ON `cafe_languages`.`cafe_id` = `menu_items`.`cafe_id` AND `cafe_languages`.`sort_order` = 1
LEFT JOIN `menu_item_translations` AS `item_translation` ON `item_translation`.`menu_item_id` = `menu_items`.`id` AND `item_translation`.`language_code` = `cafe_languages`.`language_code`
LEFT JOIN `categories` ON `categories`.`id` = `menu_items`.`category_id`
LEFT JOIN `category_translations` AS `category_translation` ON `category_translation`.`category_id` = `categories`.`id` AND `category_translation`.`language_code` = `cafe_languages`.`language_code`
WHERE `menu_items`.`cafe_id` = 3
ORDER BY `menu_items`.`sort_order` ASC, `menu_items`.`id` ASC
---
    public function getByCafe(int $cafeId): array
    {
        return $this->select('menu_items.*, item_translation.name AS name, item_translation.description AS description, category_translation.name AS category_name, categories.is_active AS category_is_active')
            ->join('cafe_languages', 'cafe_languages.cafe_id = menu_items.cafe_id AND cafe_languages.sort_order = 1', 'left')
            ->join('menu_item_translations AS item_translation', 'item_translation.menu_item_id = menu_items.id AND item_translation.language_code = cafe_languages.language_code', 'left')
            ->join('categories', 'categories.id = menu_items.category_id', 'left')
            ->join('category_translations AS category_translation', 'category_translation.category_id = categories.id AND category_translation.language_code = cafe_languages.language_code', 'left')
            ->where('menu_items.cafe_id', $cafeId)
            ->orderBy('menu_items.sort_order', 'ASC')
            ->orderBy('menu_items.id', 'ASC')
            ->findAll();

SELECT *
FROM `menu_items`
WHERE `cafe_id` = 3
AND `id` = 3
 LIMIT 1
---
    public function findByCafe(int $cafeId, int $id): ?array
    {
        return $this->where('cafe_id', $cafeId)
            ->where('id', $id)
            ->first();