app/Models/MenuItemTranslationModel.php

SELECT *
FROM `menu_item_translations`
WHERE `menu_item_id` = 3
ORDER BY `language_code` ASC
---
    public function getByMenuItemId(int $menuItemId): array
    {
        $translations = $this->where('menu_item_id', $menuItemId)
            ->orderBy('language_code', 'ASC')
            ->findAll();

SELECT *
FROM `menu_item_translations`
WHERE `menu_item_id` IN (3,5,2,6,7)
AND `language_code` IN ('pt','uz')
ORDER BY `menu_item_id` ASC, `language_code` ASC
---
    public function getByMenuItemIds(array $menuItemIds, array $languageCodes = []): array
    {
        if ($menuItemIds === []) {
            return [];
        }

        $builder = $this->whereIn('menu_item_id', $menuItemIds);

        if ($languageCodes !== []) {
            $builder->whereIn('language_code', $languageCodes);
        }

        return $builder
            ->orderBy('menu_item_id', 'ASC')
            ->orderBy('language_code', 'ASC')
            ->findAll();